Revit 2027 API
StonePatternType Enumeration
 The enumerated type representing the permitted values for the asset property "StonePattern" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StonePatternType
Public Enumeration StonePatternType
public enum class StonePatternType
type StonePatternType
Members
Member name | Value | Description
Custom | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace